ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульСборщикДанныхСтандартный/вмс_СерверУправляемыйМодульСборщикДанныхСтандартный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_СерверУправляемыйМодульСборщикДанныхСтандартный</name>
  <attributes>
    <name>Интерфейс</name>
    <type>
      <types>DataProcessorObject.вмс_СерверУправляемыйМодульСборщикДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыОбработки</name>
  </attributes>
  <attributes>
    <name>ДанныеОбработки</name>
  </attributes>
  <attributes>
    <name>ПараметрыМодуля</name>
  </attributes>
  <attributes>
    <name>ДанныеМодуля</name>
  </attributes>
  <attributes>
    <name>ДанныеТранзакции</name>
  </attributes>
  <attributes>
    <name>СостояниеМодуля</name>
  </attributes>
  <attributes>
    <name>СтандартныйМодуль</name>
    <type>
      <types>DataProcessorObject.вмс_СерверУправляемыйМодульСтандартный</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульСборщикДанныхСтандартный/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем РК;
Перем ТипыПредставлений;
Перем ПустоеПолеОбработки;

Функция Инициализировать() Экспорт
	
	//укажем реализуемые методы
	ИменаРеализуемыхМетодов =
		"ВыполнитьДействие,
		|УстановитьПоля,
		|УстановитьСвойстваПолейПоУмолчанию,
		|УстановитьДоступныеПоля,
		|УстановитьДополнительныеПоля,
		|ПриЗавершенииИнициализацииПолей,
		|ИнициализироватьДанные,
		|ЕстьИзменениеДанных,
		|НачатьВводДанных,
		|НачатьВыборСледующегоПоля,
		|РазобратьВходящиеОбъекты,
		|УстановитьРабочиеСтраницы,
		|ВводДоступен,
		|НачатьТранзакциюСборщика,
		|ОбновитьДанныеТранзакцииОбработки,
		|ЗафиксироватьТранзакциюСборщика,
		|ПослеЗавершенияТранзакцииВвода,
		|ПослеЗавершенияВвода,
		|ВозобновитьВводДанных,
		|ОтменитьТранзакциюСборщика,
		|ЗакончитьТранзакциюСборщика,
		|СохранениеДанныхСборщика,
		|ОстановитьВводДанных,
		|ОтменитьВводДанных,
		|ЗаполнитьПринятыеДанныеПолей,
		|ЗаполнитьВведенныеДанныеПолей,
		|ЗаполнитьЗапланированныеДанныеПолей,
		|ЗаполнитьДанныеПолей,
		|ЗаполнитьОбщиеДанныеПолей,
		|ЗаполнитьОбщиеДанныеПолейДополнительно,
		|ЗаполнитьСобранныеДанныеПолей,
		|ЗаполнитьСобранныеДанныеПолейДополнительно,
		|ЗаполнитьПредставлениеДанныхПолей,
		|ЗаполнитьТаблицы,
		|ПроанализироватьЗаполнениеПолейДанных,
		|РезультатАнализаЗаполненияПолейДанных,
		|ОчиститьДанныеПолей,
		|СохранитьСостояниеОбработки,
		|ВосстановитьСостояниеОбработки,
		|ВыполнитьЗавершениеОперации";

	Интерфейс.УстановитьРеализациюМетодов(ИменаРеализуемыхМетодов, ЭтотОбъект);
	
	//инициализируем этапы ввода данных
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_НачалоВвода", "НачалоВвода");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанных", "ОбработкаВходящихДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей", "ОбработкаВходящихДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ЗаполнениеВведенныхДанныхПолей", "ЗаполнениеВведенныхДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ЗаполнениеДанныхПолей", "ЗаполнениеДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверитьОтклонениеОтПлана", "ПроверитьОтклонениеОтПлана", "ЗаполнениеДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверкаСобранныхДанных", "ПроверкаСобранныхДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ЗавершениеВводаДанныхПолей", "ЗавершениеВводаДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_СохранениеДанных", "СохранениеДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_КонецВвода", "КонецВвода");
	
	ТипыПредставлений = Новый Соответствие;
	ТипыПредставлений[Тип("Неопределено")] = Истина;
	ТипыПредставлений[Тип("Null")] = Истина;
	ТипыПредставлений[Тип("Строка")] = Истина;
	ТипыПредставлений[Тип("Число")] = Истина;
	ТипыПредставлений[Тип("Дата")] = Истина;
	ТипыПредставлений[Тип("Булево")] = Истина;
	ТипыПредставлений[Тип("УникальныйИдентификатор")] = Истина;
	ТипыПредставлений[Тип("ФорматированнаяСтрока")] = Истина;
	
	ПараметрыМодуля.Вставить("ТипыПредставлений", ТипыПредставлений);
	ПараметрыМодуля.Вставить("ЗависимостиПолей", Новый Массив);
	ПараметрыМодуля.Вставить("ПоляАнализаДанных", Новый Соответствие);
	
	ПустоеПолеОбработки = ПараметрыОбработки.ПустоеПолеОбработки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Этапы ввода+
//

#Область ЭтапыВвода

Функция ОбработчикЭтапаВводаДанных_НачалоВвода(Параметры, ДополнительныеПараметры) Экспорт
	
	ДанныеТранзакции.ПринятыеДанныеПолей.Очистить();
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанных(Параметры, ДополнительныеПараметры) Экспорт
	
	Если НЕ Интерфейс.ВводДоступен() Тогда
		Возврат Ложь;
	КонецЕсли;

	ВходящиеДанные = ДанныеТранзакции.ВходящиеДанные;
	ДанныеШтрихкода = ВходящиеДанные.ДанныеШтрихкода;
	Если ДанныеШтрихкода.Обработан Тогда
		ВходящиеОбъекты = РК.ВыгрузитьЗначенияКолонкиКоллекции(ДанныеШтрихкода.Результат.НайденныеОбъекты, "Объект");
		РК.УстановитьЭлементыКоллекции(ВходящиеДанные.ВходящиеОбъекты, ВходящиеОбъекты);
	КонецЕсли;
	
	Интерфейс.РазобратьВходящиеОбъекты(ВходящиеДанные); 
	Возврат Истина;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей(Параметры, ДополнительныеПараметры) Экспорт
	
	Если ЗаполнитьПринятыеДанныеПолей(ДанныеТранзакции.ВходящиеДанные).Количество()=0 Тогда
		//нет полей для ввода
		Интерфейс.ЗакончитьТранзакциюСборщика();
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ЗаполнениеВведенныхДанныхПолей(Параметры, ДополнительныеПараметры) Экспорт

	Интерфейс.ЗаполнитьВведенныеДанныеПолей(ДанныеТранзакции.ПринятыеДанныеПолей);
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ЗаполнениеДанныхПолей(Параметры, ДополнительныеПараметры) Экспорт

	Интерфейс.ЗаполнитьДанныеПолей();
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверитьОтклонениеОтПлана(Параметры, ДополнительныеПараметры) Экспорт

	СписокВходящихПолейМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ДанныеТранзакции.ВходящиеДанные.ДанныеПолей, "Ключ");
	СписокПолейПланФактаМассив = СписокПолейМодуля(Новый Структура("План, Ввод", Истина, Истина));
	СписокВходящихПолейПланФактаМассив = РК.ПересечениеМассивов(СписокПолейПланФактаМассив, СписокВходящихПолейМассив);
	Если СписокВходящихПолейПланФактаМассив.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЗапланированныеДанныеПолей = ДанныеТранзакции.ЗапланированныеДанныеПолей;
	ЗаполненныеПоляПланаМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхПлана.ЗаполненныеПоляМассив;
	
	ПолеНайдено = Ложь;
	Для Каждого ИмяПоля Из СписокВходящихПолейПланФактаМассив Цикл
		Если ЗаполненныеПоляПланаМассив.Найти(ИмяПоля)=Неопределено Тогда
			//нет плана по этому полю
			Продолжить;
		КонецЕсли;
		
		Если ЗапланированныеДанныеПолей[ИмяПоля]=ДанныеТранзакции.ОбщиеДанныеПолей[ИмяПоля] Тогда
			//нет расхождений с планом по этому полю
			Продолжить;
		КонецЕсли;
		
		Если ДанныеМодуля.ОбщиеДанныеПолей[ИмяПоля]=ДанныеТранзакции.ОбщиеДанныеПолей[ИмяПоля] Тогда
			//нет изменений по этому полю
			Продолжить;
		КонецЕсли;
		
		ПолеНайдено = Истина;
		Прервать;
	КонецЦикла;
	
	Если НЕ ПолеНайдено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЗначениеФакта = ДанныеТранзакции.ОбщиеДанныеПолей[ИмяПоля];
	ЗначениеПлана = ЗапланированныеДанныеПолей[ИмяПоля];
	Если НЕ ЗначениеЗаполнено(ЗначениеФакта) Тогда
		ЗначениеФакта = "<пусто>";
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЗначениеПлана) Тогда
		ЗначениеПлана = "<пусто>";
	КонецЕсли;
	
	Поле = ПолеМодуля(ИмяПоля);
	ТекстСообщения = Поле.Синоним + " """ + ЗначениеФакта + """ не соответствует плану.";
	ТекстСообщения = ТекстСообщения + " Ожидается """ + ЗначениеПлана + """.";
	
	Если ПараметрыМодуля.РазрешитьВводДанныхБезПлана Тогда
		Интерфейс.ОстановитьВводДанных();
		ОО = НовыйОписаниеОповещения("ОбработчикВопросаПриВводеДанных");
		ПоказатьДиалогНаКлиенте(ОО, ТекстСообщения + " Продолжить?", "ОКОтмена", , , , "Ошибка");
	Иначе
		Интерфейс.ОтменитьВводДанных();
		ПоказатьДиалогНаКлиенте(, ТекстСообщения, , , , , "Ошибка");
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверкаСобранныхДанных(Параметры, ДополнительныеПараметры) Экспорт

КонецФункции

Функция ОбработчикЭтапаВводаДанных_ЗавершениеВводаДанныхПолей(Параметры, ДополнительныеПараметры) Экспорт
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_СохранениеДанных(Параметры, ДополнительныеПараметры) Экспорт

	//
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_КонецВвода(Параметры, ДополнительныеПараметры) Экспорт

	//

КонецФункции

Функция ОбработчикВопросаПриВводеДанных(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="ОК" Тогда
		Интерфейс.ВозобновитьВводДанных();
	Иначе
		Интерфейс.ОтменитьВводДанных();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

//
//						Этапы ввода-
//
////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Реализация методов+
//

#Область РеализацияМетодов

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Обработка событий (действий)+
//

#Область ОбработкаСобытий

Функция ВыполнитьДействие(Действие) Экспорт

	Код = Действие.Код;
	
	Если Код="ИнициализироватьПеременныеМодуляОбработки" Тогда
		
		ДействиеИнициализироватьПеременныеМодуляОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьМодульОбработки" Тогда
		
		ДействиеИнициализироватьМодульОбработки(Действие);
		
	ИначеЕсли Код="ЕстьИзменениеДанных" Тогда
		
		ДействиеЕстьИзменениеДанных(Действие);
		
	ИначеЕсли Код="СохранитьСостояниеОбработки" Тогда
		
		ДействиеСохранитьСостояниеОбработки(Действие);
		
	ИначеЕсли Код="ВосстановитьСостояниеОбработки" Тогда
		
		ДействиеВосстановитьСостояниеОбработки(Действие);
		
	ИначеЕсли Код="СохранениеДанныхСборщика" Тогда
		
		ДействиеСохранениеДанныхСборщика(Действие);
		
	КонецЕсли
	
КонецФункции

Функция ДействиеИнициализироватьПеременныеМодуляОбработки(Действие)
	
КонецФункции

Функция ДействиеИнициализироватьМодульОбработки(Действие)
	
	Интерфейс.ИнициализироватьМодульОбработки(Действие.Параметры);
	
КонецФункции

Функция ДействиеЕстьИзменениеДанных(Действие)
	
	ЕстьИзменениеДанных = Интерфейс.ЕстьИзменениеДанных();
	
	Если ЕстьИзменениеДанных Тогда
		УстановитьРезультатДействия(Действие, ЕстьИзменениеДанных);
	КонецЕсли;
	
	Возврат ЕстьИзменениеДанных;
	
КонецФункции

Функция ДействиеСохранитьСостояниеОбработки(Действие)
	
	Интерфейс.СохранитьСостояниеОбработки();
	
КонецФункции

Функция ДействиеВосстановитьСостояниеОбработки(Действие)
	
	Интерфейс.ВосстановитьСостояниеОбработки();
	
КонецФункции

Функция ДействиеСохранениеДанныхСборщика(Действие)
	
	Интерфейс.СохранениеДанныхСборщика(Действие.Параметры.Сборщик, Действие.Параметры.Отказ);
	
КонецФункции

#КонецОбласти

//
//						Обработка событий (действий)-
//
////////////////////////////////////////////////////////////////////////////////////////////

Функция УстановитьПоля(знач ОбщиеПоля=Неопределено) Экспорт
	
	ОбщиеПоля = ПоляОбработки(ОбщиеПоля);

	//очистим данные полей
	УстановитьСвойстваПолейМодуля(, "Использование", Ложь);

	//установим значения свойств по умолчанию
	Интерфейс.УстановитьСвойстваПолейПоУмолчанию();
	
	//установим общие настройки полей
	Для Каждого ОбщееПоле Из ОбщиеПоля Цикл
		УстановитьСвойстваПолейМодуля(ОбщееПоле.Имя, ОбщееПоле);
	КонецЦикла;	
	УстановитьСвойстваПолейМодуля(, "Использование", Ложь);
	
	Интерфейс.УстановитьДоступныеПоля();
	УдалитьПоляМодуля(Новый Структура("Использование", Ложь)); //удалим недоступные поля
	
	СписокОбщихПолей = РК.ВыгрузитьЗначенияКолонкиКоллекции(ОбщиеПоля, "Имя");
	Для Каждого Поле Из ПоляМодуля() Цикл
		Если СписокОбщихПолей.Найти(Поле.Имя)=Неопределено Тогда
			УстановитьСвойстваПолейМодуля(Поле, "Использование", Ложь);
		КонецЕсли;
	КонецЦикла;
	Интерфейс.УстановитьДополнительныеПоля();
	УдалитьПоляМодуля(Новый Структура("Использование", Ложь)); //удалим неиспользуемые поля
	ПоляМодуля().Сортировать("ПорядокВвода");
	
	ОбновитьЗависимостиПолей();
	
	Интерфейс.ПриЗавершенииИнициализацииПолей();
	
	Интерфейс.ИнициализироватьДанные();
	
КонецФункции

Функция УстановитьСвойстваПолейПоУмолчанию() Экспорт
	
	//
	
КонецФункции

Функция УстановитьДоступныеПоля() Экспорт

	УстановитьСвойстваПолейМодуля(, "Использование", Истина); //все
	
КонецФункции

Функция УстановитьДополнительныеПоля() Экспорт
	
	//
	
КонецФункции

Функция ПриЗавершенииИнициализацииПолей() Экспорт
	
	ЗаполнитьПоляАнализаДанных();
	
КонецФункции

Функция ПоляАнализаДанных() Экспорт
	
	Возврат ?(ДанныеТранзакции.Активна, ДанныеТранзакции.ПоляАнализаДанных, ПараметрыМодуля.ПоляАнализаДанных);
	
КонецФункции

Функция ЗаполнитьПоляАнализаДанных() Экспорт
	
	ПоляМодуля = ПоляМодуля().Скопировать();
	ПоляМодуля.Сортировать("ПорядокВвода");
	
	ПоляАнализаДанных = ПоляАнализаДанных();
	
	ПоляАнализаДанных["ВведенныеДанныеПолей"]		= Новый Структура("Поля, ИмяРезультата", ПоляМодуля.НайтиСтроки(Новый Структура("Ввод", Истина)), "РезультатАнализаЗаполненияПолейДанныхВвода");
	ПоляАнализаДанных["ЗапланированныеДанныеПолей"]	= Новый Структура("Поля, ИмяРезультата", ПоляМодуля.НайтиСтроки(Новый Структура("План", Истина)), "РезультатАнализаЗаполненияПолейДанныхПлана");
	ПоляАнализаДанных["СобранныеДанныеПолей"]		= Новый Структура("Поля, ИмяРезультата", ПоляМодуля.НайтиСтроки(Новый Структура("Сборка", Истина)), "РезультатАнализаЗаполненияПолейДанныхСборки");
	ПоляАнализаДанных["ОбщиеДанныеПолей"]			= Новый Структура("Поля, ИмяРезультата", ПоляМодуля, "РезультатАнализаЗаполненияПолейОбщихДанных");
	
КонецФункции

Функция ИнициализироватьДанные() Экспорт
	
	ИнициализироватьСвойстваОперации();
	
КонецФункции

Функция ИнициализироватьСвойстваОперации()
	
	ПараметрыМодуля.Вставить("РазрешитьВводДанныхБезПлана", Ложь);

	Возврат Истина;
		
КонецФункции

Функция ЕстьИзменениеДанных() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ОбновитьЗависимостиПолей()
	
	ЗависимостиПолей = ПараметрыМодуля.ЗависимостиПолей;
	
	ИсточникиДанныхПолей = РК.ЗначениеВМассив("ДанныеВвода, ДанныеПлана, ОбщиеДанные, ДанныеСбора");
	
	ПутиКДаннымПолей = Обработки.вмс_СерверУправляемыйМодульСтандартный.ПрочитатьПутиКДаннымПолей(ПараметрыМодуля, "ПутьКДаннымЗаполнения");
	
	ЗависимостиПолей.Очистить();
	Для Каждого ПутьКДаннымПоля Из ПутиКДаннымПолей Цикл
		Если ПутьКДаннымПоля.ПутьКДанным="" Тогда
			Продолжить;
		КонецЕсли;
		
		ИсточникДанных = ПутьКДаннымПоля.ПутьРеквизита;
		Если ИсточникДанных="" Тогда
			ИсточникДанных = "ОбщиеДанные";
		КонецЕсли;
		
		Если ИсточникиДанныхПолей.Найти(ИсточникДанных)=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеЗависимости = ПутьКДаннымПоля.ИмяРеквизита;
		Если ЗависимостиПолей.Найти(ПолеЗависимости)=Неопределено Тогда
			ЗависимостиПолей.Добавить(ПолеЗависимости);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция НачатьВводДанных(знач ВходящиеДанные) Экспорт
	
	Для Каждого ЭтапВводаДанных Из ПараметрыМодуля.ЭтапыВводаДанных Цикл
		ЭтапВводаДанных.Пропускать = Ложь;
		ЭтапВводаДанных.Данные.Очистить();
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция НачатьВыборСледующегоПоля() Экспорт
	
	ИмяПоля = СледующееПолеВвода();
	Если ИмяПоля=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеМодуля = ПолеМодуля(ИмяПоля);
	Если НЕ ПолеМодуля.АвтоНачалоВыбора Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбработчикСобытияПоля = Неопределено;
	ПолеМодуля.События.Свойство("НачалоВыбора", ОбработчикСобытияПоля);
	
	Если ОбработчикСобытияПоля=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	вмс_СерверУправляемыеОбработки.ВыполнитьОбработкуОповещенияПереопределенный(ОбработчикСобытияПоля);
	Возврат Истина;
	
КонецФункции

Функция СледующееПолеВвода()

	НеЗаполненныеПоляМассив = ДанныеМодуля.РезультатАнализаЗаполненияПолейДанныхВвода.НеЗаполненныеПоляМассив;
	
	Если НеЗаполненныеПоляМассив.Количество() > 0 Тогда
		
		СледующееПолеВвода = НеЗаполненныеПоляМассив[0];
		Возврат СледующееПолеВвода;
		
	КонецЕсли;
	
КонецФункции

Функция ВозобновитьВводДанных() Экспорт
	
	вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВозобновитьВводДанных"));
	
КонецФункции

Функция СохранениеДанныхСборщика(Сборщик, Отказ) Экспорт
	
	//
	
КонецФункции

Функция ЗаполнитьПринятыеДанныеПолей(ВходящиеДанные) Экспорт

	ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеПолей;
	
	Для Каждого ВходящееПоле Из ВходящиеДанные.ДанныеПолей Цикл
		
		ИмяПоля = ВходящееПоле.Ключ;
		
		Поле = ПолеМодуля(ИмяПоля);
		Если НЕ (Поле <> ПустоеПолеОбработки И Поле.Ввод) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = ВходящееПоле.Значение;
		Если ТипЗнч(Поле.ТипЗначения)=Тип("ОписаниеТипов") Тогда
			Значение = Поле.ТипЗначения.ПривестиЗначение(Значение);
		КонецЕсли;
		
		ПринятыеДанныеПолей.Вставить(ИмяПоля, Значение);
		
	КонецЦикла;
	
	Возврат ПринятыеДанныеПолей;
	
КонецФункции

Функция ЗаполнитьВведенныеДанныеПолей(ПринятыеДанныеПолей) Экспорт
	
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	
	ЗаполнитьЗначенияСвойств(ВведенныеДанныеПолей, ПринятыеДанныеПолей);
	
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных("ВведенныеДанныеПолей");
	
	Возврат ВведенныеДанныеПолей;
	
КонецФункции

Функция ЗаполнитьЗапланированныеДанныеПолей() Экспорт
	
	Результат = Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьТаблицыВычисленийЗначенийПолей(ПараметрыМодуля);
	ТаблицаВычисленийЗначенийПолей = Результат.ТаблицаВычисленийЗначенийПолей;
	ТаблицаВычисляемыхПолей = Результат.ТаблицаВычисляемыхПолей;
	
	ЗапланированныеДанныеПолей = ДанныеТранзакции.ЗапланированныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	
	ТаблицаРаундов = ТаблицаВычисленийЗначенийПолей.Скопировать();
	ТаблицаРаундов.Свернуть("Раунд");
	
	Для Каждого ЭлементРаунда Из ТаблицаРаундов Цикл
		
		Раунд = ЭлементРаунда.Раунд;
		ТаблицаВычисленийЗначенийПолейРаунда = ТаблицаВычисленийЗначенийПолей.Скопировать(Новый Структура("Раунд", Раунд));
		ТаблицаВычисленийЗначенийПолейРаунда.Сортировать("ПолноеИмя");
		
		ТаблицаВычисляемыхПолейРаунда = ТаблицаВычисляемыхПолей.Скопировать(Новый Структура("Раунд", Раунд));
		
		ЗаполненныеПоляЗапланированныхДанныхМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхПлана.ЗаполненныеПоляМассив;
		НеЗаполненныеПоляЗапланированныхДанныхМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхПлана.НеЗаполненныеПоляМассив;
		ЗаполненныеПоляОбщихДанныхМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейОбщихДанных.ЗаполненныеПоляМассив;
		НеЗаполненныеПоляОбщихДанныхМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейОбщихДанных.НеЗаполненныеПоляМассив;
		
		Для Каждого ЭлементВычисленияЗначения Из ТаблицаВычисленийЗначенийПолейРаунда Цикл
			
			Если ЭлементВычисленияЗначения.ЗначениеРассчитано Тогда
				Продолжить;
			ИначеЕсли СтандартныйМодуль.ИсточникДанныхДляЗаполненияПолей(ЭлементВычисленияЗначения.ПолноеИмя) <> Неопределено Тогда
				Значение = СтандартныйМодуль.ДанныеИсточникаДляЗаполненияПолей(ЭлементВычисленияЗначения.ПолноеИмя);
			Иначе
				ЭлементВычисленияРодительМассив = ТаблицаВычисленийЗначенийПолейРаунда.НайтиСтроки(Новый Структура("ПолноеИмя", ЭлементВычисленияЗначения.Путь));
				Если ЭлементВычисленияРодительМассив.Количество() > 0 Тогда
					ЭлементВычисленияРодитель = ЭлементВычисленияРодительМассив[0];
					Если НЕ ЭлементВычисленияРодитель.ЗначениеРассчитано Тогда
						ВызватьИсключение "значение не рассчитано """ + ЭлементВычисленияРодитель.ПолноеИмя + """";
					КонецЕсли;
					ЗначениеРодителя = ЭлементВычисленияРодитель.Значение;
				Иначе
					ЗначениеРодителя = ОбщиеДанныеПолей;
				КонецЕсли;
				
				Если ЗначениеРодителя=Неопределено Тогда
					Значение = Неопределено;
				Иначе
					Значение = ЗначениеРодителя[ЭлементВычисленияЗначения.Имя];
				КонецЕсли;
			КонецЕсли;
			
			Попытка
				//если это табличная часть
				Таблица = Значение.Выгрузить();
				Значение = Таблица;
			Исключение
			КонецПопытки;
			
			Если ТипЗнч(Значение)=Тип("ТаблицаЗначений") Тогда
				//поищем элемент таблицы по заполненным полям
				Таблица = Значение;
				ЭлементыВычисленийЗначенийКолонокТаблицы = ТаблицаВычисленийЗначенийПолейРаунда.НайтиСтроки(Новый Структура("Путь", ЭлементВычисленияЗначения.ПолноеИмя));
				ОтборЭлементаТаблицы = Новый Структура;
				Для Каждого ЭлементВычисленияЗначенияКолонкиТаблицы Из ЭлементыВычисленийЗначенийКолонокТаблицы Цикл
					ПолеРаундаМассив = ТаблицаВычисляемыхПолейРаунда.НайтиСтроки(Новый Структура("ПутьКДанным", ЭлементВычисленияЗначенияКолонкиТаблицы.ПолноеИмя));
					Для Каждого ПолеРаунда Из ПолеРаундаМассив Цикл
						Если ПолеРаунда.Поиск И ПолеРаунда.План И ЗаполненныеПоляОбщихДанныхМассив.Найти(ПолеРаунда.ИмяПоля) <> Неопределено Тогда
							ОтборЭлементаТаблицы.Вставить(ЭлементВычисленияЗначенияКолонкиТаблицы.Имя, ОбщиеДанныеПолей[ПолеРаунда.ИмяПоля]);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				Если ОтборЭлементаТаблицы.Количество()=0 Тогда
					НайденныеЭлементыТаблицы = Новый Массив;
					Если Таблица.Количество() > 0 Тогда
						НайденныеЭлементыТаблицы.Добавить(Таблица[0]);
					КонецЕсли;
				Иначе
					НайденныеЭлементыТаблицы = Таблица.НайтиСтроки(ОтборЭлементаТаблицы);
				КонецЕсли;
				
				Если НайденныеЭлементыТаблицы.Количество()=0 Тогда
					//не найдено подходящих элементов таблицы, возьмем значение из существующего поля
					УдалениеЭлементовВычислений = Новый Массив;
					Для Каждого ЭлементВычисленияКолонки Из ЭлементыВычисленийЗначенийКолонокТаблицы Цикл
						ПолеРаундаМассив = ТаблицаВычисляемыхПолейРаунда.НайтиСтроки(Новый Структура("ПутьКДанным", ЭлементВычисленияКолонки.ПолноеИмя));
						Если ПолеРаундаМассив.Количество() > 0 Тогда
							ПолеРаунда = ПолеРаундаМассив[0];
							ЭлементВычисленияКолонки.Значение = ОбщиеДанныеПолей[ПолеРаунда.ИмяПоля];
							ЭлементВычисленияКолонки.ЗначениеРассчитано = Истина;
						Иначе
							УдалениеЭлементовВычислений.Добавить(ЭлементВычисленияКолонки);
						КонецЕсли;
					КонецЦикла;

					//удалим связанные с таблицей расчеты иерархически
					Для Каждого ЭлементВычисления Из УдалениеЭлементовВычислений Цикл
						РК.ДобавитьЭлементыКоллекции(УдалениеЭлементовВычислений, ТаблицаВычисленийЗначенийПолейРаунда.НайтиСтроки(Новый Структура("Путь", ЭлементВычисления.ПолноеИмя)));
						ТаблицаВычисленийЗначенийПолейРаунда.Удалить(ЭлементВычисления);
					КонецЦикла;
					
					Значение = Неопределено;
				Иначе
					Значение = НайденныеЭлементыТаблицы[0];
					ЭлементВычисленияЗначения.ЗначениеРассчитано = Истина;
				КонецЕсли;
			Иначе
				ЭлементВычисленияЗначения.ЗначениеРассчитано = Истина;
			КонецЕсли;

			ЭлементВычисленияЗначения.Значение = Значение;
			
			//заполним связанные незаполненные поля данных
			ВычисляемыеПоля = ТаблицаВычисляемыхПолейРаунда.НайтиСтроки(Новый Структура("ПутьКДанным", ЭлементВычисленияЗначения.ПолноеИмя));
			Для Каждого ВычисляемоеПоле Из ВычисляемыеПоля Цикл
				Если ВычисляемоеПоле.План И ЗаполненныеПоляЗапланированныхДанныхМассив.Найти(ВычисляемоеПоле.ИмяПоля)=Неопределено Тогда
					ЗапланированныеДанныеПолей[ВычисляемоеПоле.ИмяПоля] = Значение;
				КонецЕсли;

				Если ЗаполненныеПоляОбщихДанныхМассив.Найти(ВычисляемоеПоле.ИмяПоля)=Неопределено Тогда
					ОбщиеДанныеПолей[ВычисляемоеПоле.ИмяПоля] = Значение;
				КонецЕсли;
			КонецЦикла;

		КонецЦикла;
		
		Интерфейс.ПроанализироватьЗаполнениеПолейДанных("ЗапланированныеДанныеПолей, ОбщиеДанныеПолей");
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьДанныеПолей() Экспорт
	Интерфейс.ОчиститьДанныеПолей(, "ЗапланированныеДанныеПолей, СобранныеДанныеПолей, ОбщиеДанныеПолей");
	Интерфейс.ЗаполнитьОбщиеДанныеПолей();
	Интерфейс.ЗаполнитьСобранныеДанныеПолей();
КонецФункции

Функция ЗаполнитьОбщиеДанныеПолей() Экспорт
	
	Для Каждого ИмяПоля Из СписокПолейВвода() Цикл
		ДанныеТранзакции.ОбщиеДанныеПолей[ИмяПоля] = ДанныеТранзакции.ВведенныеДанныеПолей[ИмяПоля];
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(ДанныеТранзакции.ОбщиеДанныеПолей, ДанныеТранзакции.СтатическиеДанныеПолей);
	Интерфейс.ЗаполнитьОбщиеДанныеПолейДополнительно();
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных("ОбщиеДанныеПолей");
	
	Интерфейс.ЗаполнитьЗапланированныеДанныеПолей();
	ЗаполнитьДанныеПолейПоУмолчанию();
	
КонецФункции

Функция ЗаполнитьОбщиеДанныеПолейДополнительно() Экспорт
КонецФункции

Функция ЗаполнитьСобранныеДанныеПолей() Экспорт
	
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	
	ПоляСборки = ПоляМодуля(Новый Структура("Сборка", Истина));
	Для Каждого ПолеСборки Из ПоляСборки Цикл
		
		ИмяПоля = ПолеСборки.Имя;
		Если ПолеСборки.Ввод И ПолеСборки.ОбязательныйВвод Тогда
			ЗначениеПоля = ВведенныеДанныеПолей[ИмяПоля];
		Иначе
			ЗначениеПоля = ОбщиеДанныеПолей[ИмяПоля];
		КонецЕсли;
		
		СобранныеДанныеПолей[ИмяПоля] = ЗначениеПоля;
		
	КонецЦикла;
	
	Интерфейс.ЗаполнитьСобранныеДанныеПолейДополнительно();
	
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных("СобранныеДанныеПолей");
	
	Возврат СобранныеДанныеПолей;
	
КонецФункции

Функция ЗаполнитьСобранныеДанныеПолейДополнительно() Экспорт
КонецФункции

Функция ЗаполнитьДанныеПолейПоУмолчанию() Экспорт
	
	ДанныеПолейМассив = Новый Массив;
	ДанныеПолейМассив.Добавить(Новый Структура("Данные, Поля, РезультатАнализаЗаполненияПолейДанных", ДанныеТранзакции.ЗапланированныеДанныеПолей, ПоляМодуля(Новый Структура("План", Истина)), ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхПлана));
	ДанныеПолейМассив.Добавить(Новый Структура("Данные, Поля, РезультатАнализаЗаполненияПолейДанных", ДанныеТранзакции.ОбщиеДанныеПолей, ПоляМодуля(), ДанныеТранзакции.РезультатАнализаЗаполненияПолейОбщихДанных));
	
	Для Каждого ДанныеПолей Из ДанныеПолейМассив Цикл
		
		Данные = ДанныеПолей.Данные;
		Поля = ДанныеПолей.Поля;
		РезультатАнализаЗаполненияПолейДанных = ДанныеПолей.РезультатАнализаЗаполненияПолейДанных;
		
		ЗаполненныеПоляМассив = РезультатАнализаЗаполненияПолейДанных.ЗаполненныеПоляМассив;
	
		Для Каждого Поле Из Поля Цикл
			
			ИмяПоля = Поле.Имя;
			
			Если ЗаполненныеПоляМассив.Найти(ИмяПоля)=Неопределено Тогда
				Данные[ИмяПоля] = Поле.ЗначениеПоУмолчанию;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных("ЗапланированныеДанныеПолей, ОбщиеДанныеПолей");
	
КонецФункции

Функция ЗаполнитьПредставлениеДанныхПолей() Экспорт
	
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	ЗапланированныеДанныеПолей = ДанныеТранзакции.ЗапланированныеДанныеПолей;
	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	ПредставлениеДанныхПолей = ДанныеТранзакции.ПредставлениеДанныхПолей;
	
	ЦветФонаОбычный = Новый Цвет(255, 255, 255);
	ЦветФонаПоляНеВведено = Новый Цвет(255, 255, 100);
	
	ШрифтРасхождения = Новый Шрифт(, , , , , Истина);
	
	ЭлементыВывода = ПараметрыОбработки.ЭлементыВывода;
	ОтборЭлементаВывода = Новый Структура("Имя");
	ТипЭлемента = Неопределено;
	СписокВыбора = Неопределено;
	
	Для Каждого Поле Из ПоляВывода() Цикл
		
		ИмяПоля = Поле.Имя;
		Если Поле.Сборка Тогда
			ЗначениеФакта = СобранныеДанныеПолей[ИмяПоля];
			ЗначениеФактаЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.ЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
			ЗначениеФактаНеЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.НеЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
		ИначеЕсли Поле.Ввод Тогда
			ЗначениеФакта = ВведенныеДанныеПолей[ИмяПоля];
			ЗначениеФактаЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
			ЗначениеФактаНеЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.НеЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
		Иначе
			ЗначениеФакта = Неопределено;
			ЗначениеФактаЗаполнено = Ложь;
			ЗначениеФактаНеЗаполнено = Ложь;
		КонецЕсли;
		
		Если Поле.План Тогда
			ЗначениеПлана = ЗапланированныеДанныеПолей[ИмяПоля];
			ЗначениеПланаЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхПлана.ЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
			ЗначениеПланаНеЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхПлана.НеЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
		Иначе
			ЗначениеПлана = ОбщиеДанныеПолей[ИмяПоля];
			ЗначениеПланаЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейОбщихДанных.ЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
			ЗначениеПланаНеЗаполнено = ДанныеТранзакции.РезультатАнализаЗаполненияПолейОбщихДанных.НеЗаполненныеПоляМассив.Найти(ИмяПоля) <> Неопределено;
		КонецЕсли;
		
		ОтборЭлементаВывода.Имя = Поле.ИмяЭлементаВывода;
		ЭлементВыводаМассив = ЭлементыВывода.НайтиСтроки(ОтборЭлементаВывода);
		Если ЭлементВыводаМассив.Количество()=0 Тогда
			ЭлементВывода = СтандартныйМодуль.ПолучитьЭлементВывода(Поле.ИмяЭлементаВывода);
		Иначе
			ЭлементВывода = ЭлементВыводаМассив[0];
		КонецЕсли;
		
		Если ЭлементВывода.Новый Тогда
			СтандартныйМодуль.ИнициализироватьЭлементВыводаДляПоляОбработки(ЭлементВывода, Поле);
		КонецЕсли;

		ЭлементВывода.Свойства.Свойство("ТипЭлемента", ТипЭлемента);
		
		ЦветФона = ЦветФонаОбычный;
		МассивСтрокПредставления = Новый Массив;
		
		Если ЗначениеПланаЗаполнено Тогда
			Если ЗначениеЗаполнено(ЗначениеПлана) Тогда
				ПредставлениеЗначенияПлана = Строка(ЗначениеПлана);
			Иначе
				ПредставлениеЗначенияПлана = "<пусто>";
			КонецЕсли;
			
			Если НЕ ЗначениеФактаЗаполнено Тогда
				Если ЗначениеФактаНеЗаполнено Тогда
					ЦветФона = ЦветФонаПоляНеВведено;
				КонецЕсли;
				МассивСтрокПредставления.Добавить(Новый ФорматированнаяСтрока(ПредставлениеЗначенияПлана, , , ЦветФона));
			ИначеЕсли ЗначениеПлана <> ЗначениеФакта Тогда
				МассивСтрокПредставления.Добавить(Новый ФорматированнаяСтрока(ПредставлениеЗначенияПлана, ШрифтРасхождения, , ));
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеФактаЗаполнено Тогда
			
			Если ЗначениеЗаполнено(ЗначениеФакта) Тогда
				ПредставлениеЗначенияФакта = Строка(ЗначениеФакта);
			Иначе
				ПредставлениеЗначенияФакта = "<пусто>";
			КонецЕсли;

			Если МассивСтрокПредставления.Количество() > 0 Тогда
				МассивСтрокПредставления.Добавить(" ");
			КонецЕсли;
			
			МассивСтрокПредставления.Добавить(ПредставлениеЗначенияФакта);
			
		ИначеЕсли НЕ ЗначениеПланаЗаполнено Тогда

			Если ЗначениеФактаНеЗаполнено Тогда
				Если Поле.Пол="Мужской" Тогда
					ТекстНеЗаполнено = "не заполнен";
				ИначеЕсли Поле.Пол="Женский" Тогда
					ТекстНеЗаполнено = "не заполнена";
				Иначе
					ТекстНеЗаполнено = "не заполнено";
				КонецЕсли;
				
				ЦветФона = ЦветФонаПоляНеВведено;
				МассивСтрокПредставления.Добавить(Новый ФорматированнаяСтрока("<" + ТекстНеЗаполнено + ">", , , ЦветФона));
			Иначе
				МассивСтрокПредставления.Добавить("<пусто>");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(Поле.ТипЗначения)=Тип("ОписаниеТипов") И Поле.ТипЗначения.Типы().Количество()=1 Тогда
			Тип = Поле.ТипЗначения.Типы()[0];
		Иначе
			Тип = Неопределено;
		КонецЕсли;
		
		Если ЭлементВывода.Свойства.Свойство("СписокВыбора", СписокВыбора) И СписокВыбора <> Неопределено Тогда
			Значение = ОбщиеДанныеПолей[ИмяПоля];
			ЭлементСписка = СписокВыбора.НайтиПоЗначению(Значение);
			Если ЭлементСписка <> Неопределено Тогда
				Значение = ЭлементСписка.ПолучитьИдентификатор() + 1;
			Иначе
				Значение = 0;
			КонецЕсли;
			ПредставлениеДанныхПолей[ИмяПоля] = Значение;
		ИначеЕсли ТипЭлемента="ПолеВвода" И ТипыПредставлений[Тип]=Истина ИЛИ ТипЭлемента="ПолеФлажка" Тогда
			ПредставлениеДанныхПолей[ИмяПоля] = ОбщиеДанныеПолей[ИмяПоля];
		Иначе
			ПредставлениеДанныхПолей[ИмяПоля] = Новый ФорматированнаяСтрока(МассивСтрокПредставления);
		КонецЕсли;

		Если ТипЭлемента="ПолеВвода" ИЛИ ТипЭлемента="ПолеФлажка" Тогда
			ЭлементВывода.Свойства.Вставить("ЦветФона", ЦветФона);
			ЭлементВывода.СвойстваПередать.Вставить("ЦветФона", ЦветФона);
			ЭлементВывода.Обновить = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПредставлениеДанныхПолей;
	
КонецФункции

Функция ЗаполнитьТаблицы() Экспорт
	
	//
	
КонецФункции

Функция НачатьТранзакциюСборщика() Экспорт
	
	Если ДанныеТранзакции.Активна Тогда
		//отмена предыдущей транзакции
		//возможно не завершилась из-за критической ошибки выполнения кода
		ОтменитьТранзакциюСборщика();
	КонецЕсли;
	
	ДанныеТранзакции.НомерЭтапа = 0;
	
	//добавим текущие данные модуля в транзакцию
	Обработки.вмс_СерверУправляемыйМодульСтандартный.НачатьТранзакциюОбработки(ПараметрыМодуля);
	ДанныеТранзакции.Вставить("ПоляАнализаДанных", РК.СкопироватьОбъект(ПараметрыМодуля.ПоляАнализаДанных));
	
	//добавим общие данные обработки в транзакцию
	ДанныеТранзакцииОбработки = ПараметрыОбработки.ДанныеТранзакции;
	ДанныеТранзакции.ПринятыеДанныеПолей.Очистить();
	ДанныеТранзакции.ВходящиеДанные = ДанныеТранзакцииОбработки.ВходящиеДанные;
	ЗаполнитьЗначенияСвойств(ДанныеТранзакции.ВведенныеДанныеПолей, ДанныеТранзакцииОбработки.ВведенныеДанныеПолей);
	СкопироватьСтатическиеДанныеПолейТранзакции(ПараметрыОбработки, ПараметрыМодуля);
	ЗаполнитьЗначенияСвойств(ДанныеТранзакции.ЗапланированныеДанныеПолей, ДанныеТранзакцииОбработки.ЗапланированныеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеТранзакции.СобранныеДанныеПолей, ДанныеТранзакцииОбработки.СобранныеДанныеПолей);
	СкопироватьОбщиеДанныеПолейТранзакции(ПараметрыОбработки, ПараметрыМодуля);
	ЗаполнитьЗначенияСвойств(ДанныеТранзакции.ПредставлениеДанныхПолей, ДанныеТранзакцииОбработки.ПредставлениеДанныхПолей);
	
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных();
	
	Возврат Истина;
	
КонецФункции

Функция	СкопироватьСтатическиеДанныеПолейТранзакции(ПараметрыОбработкиИсточника, ПараметрыОбработкиПриемника)
	
	ПоляИсточника = ПараметрыОбработкиИсточника.ДанныеТранзакции.ПоляОбработки;
	ПоляПриемника = ПараметрыОбработкиПриемника.ДанныеТранзакции.ПоляОбработки;

	СтатическиеДанныеПолейИсточника = ПараметрыОбработкиИсточника.ДанныеТранзакции.СтатическиеДанныеПолей;
	СтатическиеДанныеПолейПриемника = ПараметрыОбработкиПриемника.ДанныеТранзакции.СтатическиеДанныеПолей;
	
	Для Каждого ПолеДанных Из СтатическиеДанныеПолейПриемника Цикл
		Если ПоляИсточника.НайтиСтроки(Новый Структура("Имя", ПолеДанных.Ключ)).Количество() > 0
			И НЕ СтатическиеДанныеПолейИсточника.Свойство(ПолеДанных.Ключ) Тогда
			СтатическиеДанныеПолейПриемника.Удалить(ПолеДанных.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПолеДанных Из СтатическиеДанныеПолейИсточника Цикл
		ПолеПриемникаМассив = ПоляПриемника.НайтиСтроки(Новый Структура("Имя", ПолеДанных.Ключ));
		Если ПолеПриемникаМассив.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеПриемника = ПолеПриемникаМассив[0];
		ПолеПриемника.Значение = ПолеДанных.Значение;
		ПолеПриемника.ЗначениеУстановлено = Истина;
		СтатическиеДанныеПолейПриемника.Вставить(ПолеДанных.Ключ, ПолеДанных.Значение);
	КонецЦикла;
	
КонецФункции

//добавим общие поля обработки в транзакцию сборщика, чтобы их можно было использовать как источник для заполнения
Функция	СкопироватьОбщиеДанныеПолейТранзакции(ПараметрыОбработкиИсточника, ПараметрыОбработкиПриемника)
	
	ОбщиеДанныеПолейИсточника = ПараметрыОбработкиИсточника.ДанныеТранзакции.ОбщиеДанныеПолей;
	ОбщиеДанныеПолейПриемника = ПараметрыОбработкиПриемника.ДанныеТранзакции.ОбщиеДанныеПолей;
	
	Для Каждого ПолеДанных Из ОбщиеДанныеПолейИсточника Цикл
		ОбщиеДанныеПолейПриемника.Вставить(ПолеДанных.Ключ, ПолеДанных.Значение);
	КонецЦикла;
	
КонецФункции

Функция ОстановитьВводДанных(ПропуститьЭтап) Экспорт

	Интерфейс.ОтменитьТранзакциюСборщика();
	
	СтандартныйМодуль.ОстановитьВводДанных(ПропуститьЭтап);
	
КонецФункции

Функция ОтменитьВводДанных() Экспорт

	Интерфейс.ОтменитьТранзакциюСборщика();
	
	СтандартныйМодуль.ОтменитьВводДанных();
	
КонецФункции

Функция ОтменитьТранзакциюСборщика() Экспорт
	
	Интерфейс.ЗакончитьТранзакциюСборщика();
	ДанныеТранзакции.Отменить = Истина;
	
КонецФункции

Функция ЗакончитьТранзакциюСборщика() Экспорт
	
	ДанныеТранзакции.Активна = Ложь;
	ДанныеТранзакции.Прервать = Истина;
	
КонецФункции

Функция ОбновитьДанныеТранзакцииОбработки() Экспорт
	
	Если ДанныеТранзакции.Отменить Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеТранзакцииОбработки = ПараметрыОбработки.ДанныеТранзакции;
	ДанныеТранзакцииОбработки.ВходящиеДанные = ДанныеТранзакции.ВходящиеДанные;
	Для Каждого ПринятоеПолеДанных Из ДанныеТранзакции.ПринятыеДанныеПолей Цикл
		ДанныеТранзакцииОбработки.ПринятыеДанныеПолей.Вставить(ПринятоеПолеДанных.Ключ, ПринятоеПолеДанных.Значение);
	КонецЦикла;

	ЗаполнитьЗначенияСвойств(ДанныеТранзакцииОбработки.ВведенныеДанныеПолей, ДанныеТранзакции.ВведенныеДанныеПолей);
	СкопироватьСтатическиеДанныеПолейТранзакции(ПараметрыМодуля, ПараметрыОбработки);
	ЗаполнитьЗначенияСвойств(ДанныеТранзакцииОбработки.ЗапланированныеДанныеПолей, ДанныеТранзакции.ЗапланированныеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеТранзакцииОбработки.СобранныеДанныеПолей, ДанныеТранзакции.СобранныеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеТранзакцииОбработки.ОбщиеДанныеПолей, ДанныеТранзакции.ОбщиеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеТранзакцииОбработки.ПредставлениеДанныхПолей, ДанныеТранзакции.ПредставлениеДанныхПолей);
	
	Возврат Истина;
	
КонецФункции

Функция ЗафиксироватьТранзакциюСборщика() Экспорт
	
	Если ДанныеТранзакции.Отменить Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Обработки.вмс_СерверУправляемыйМодульСтандартный.ЗафиксироватьТранзакциюОбработки(ПараметрыМодуля);
	ПараметрыМодуля.ПоляАнализаДанных = ДанныеТранзакции.ПоляАнализаДанных;
	
	Возврат Истина;
	
КонецФункции

Функция ПослеЗавершенияТранзакцииВвода() Экспорт
	
	
КонецФункции

Функция ПослеЗавершенияВвода() Экспорт

	Если НЕ Интерфейс.ВводДоступен() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеТранзакции.ПринятыеДанныеПолей.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьВыборСледующегоПоля();
	Возврат Истина;
	
КонецФункции

// 3.2.5
Функция ПроанализироватьЗаполнениеПолейДанных(знач ИмяДанных=Неопределено) Экспорт
	
	Если ИмяДанных=Неопределено Тогда
		ИмяДанных = "ВведенныеДанныеПолей, ЗапланированныеДанныеПолей, СобранныеДанныеПолей, ОбщиеДанныеПолей";
	КонецЕсли;
	
	АктивныеДанные = ?(ДанныеТранзакции.Активна, ДанныеТранзакции, ДанныеМодуля);
		
	ИмяДанныхМассив = РК.ЗначениеВМассив(ИмяДанных, , Ложь);
	
	МодульМетодаРезультатАнализаЗаполненияПолейДанных = Интерфейс.МодулиМетодов.РезультатАнализаЗаполненияПолейДанных;
	
	ПоляАнализаДанных = ПоляАнализаДанных();
	Для Каждого ИмяДанных Из ИмяДанныхМассив Цикл
		ЭлементПолейАнализаДанных = ПоляАнализаДанных[ИмяДанных];
		Если ЭлементПолейАнализаДанных=Неопределено Тогда
			ВызватьИсключение "Неизвестный вид данных полей """ + ИмяДанных + """";
		КонецЕсли;

		Данные = АктивныеДанные[ИмяДанных];
		РезультатАнализаЗаполненияПолейДанных = МодульМетодаРезультатАнализаЗаполненияПолейДанных.РезультатАнализаЗаполненияПолейДанных(ЭлементПолейАнализаДанных.Поля, Данные);
		АктивныеДанные.Вставить(ЭлементПолейАнализаДанных.ИмяРезультата, РезультатАнализаЗаполненияПолейДанных);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция РезультатАнализаЗаполненияПолейДанных(Поля, Данные) Экспорт

	Перем ЗначениеПоля;
	
	Результат = Обработки.вмс_СерверУправляемыйМодульСборщикДанных.НовыйРезультатАнализаЗаполненияПолейДанных();
	
	НеЗаполненныеПоляМассив = Результат.НеЗаполненныеПоляМассив;
	ЗаполненныеПоляМассив = Результат.ЗаполненныеПоляМассив;
	
	ОсновныеПоляЗаполнены = Истина;
	Для Каждого Поле Из Поля Цикл
		
		ИмяПоля = Поле.Имя;
		Если НЕ Данные.Свойство(ИмяПоля, ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;
		
		Заполнено = Поле.ПустыеЗначения.Найти(ЗначениеПоля)=Неопределено;
		
		Если Заполнено Тогда
			ЗаполненныеПоляМассив.Добавить(ИмяПоля);
		ИначеЕсли Поле.ОбязательноеЗаполнение Тогда
			НеЗаполненныеПоляМассив.Добавить(ИмяПоля);
			Если НЕ Поле.Ресурс Тогда
				ОсновныеПоляЗаполнены = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ОсновныеПоляЗаполнены = ОсновныеПоляЗаполнены;
	
	Обработки.вмс_СерверУправляемыйМодульСборщикДанных.ФинализироватьРезультатАнализаЗаполненияПолейДанных(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ОчиститьДанныеПолей(знач Поля=Неопределено, знач ИмяДанных=Неопределено) Экспорт
	
	Если ИмяДанных=Неопределено Тогда
		ИмяДанных = "ВведенныеДанныеПолей, ЗапланированныеДанныеПолей, СобранныеДанныеПолей, ОбщиеДанныеПолей";
	КонецЕсли;

	ИмяДанныхМассив = РК.ЗначениеВМассив(ИмяДанных, , Ложь);
	Если ИмяДанныхМассив.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;

	Обработки.вмс_СерверУправляемыйМодульСтандартный.ОчиститьДанныеПолей(ПараметрыМодуля, Поля, ИмяДанныхМассив);
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных(ИмяДанныхМассив);
	Возврат Истина;
	
КонецФункции

Функция СохранитьСостояниеОбработки() Экспорт
	
	СостояниеМодуля.Вставить("ПоляОбработки", ПараметрыМодуля.ПоляОбработки);
	СостояниеМодуля.Вставить("ЭтапыВводаДанных", ПараметрыМодуля.ЭтапыВводаДанных)
	
КонецФункции

Функция ВосстановитьСостояниеОбработки() Экспорт

	ПараметрыМодуля.ПоляОбработки = СостояниеМодуля.ПоляОбработки;
	ПараметрыМодуля.ЭтапыВводаДанных = СостояниеМодуля.ЭтапыВводаДанных;
	
	ЗаполнитьПоляАнализаДанных();
	
КонецФункции

//определить по типу объектов в какие поля данных они должны попасть
Функция РазобратьВходящиеОбъекты(ВходящиеДанные, знач ПоляВвода=Неопределено) Экспорт

	ВходящиеОбъекты = ВходящиеДанные.ВходящиеОбъекты;
	Если ВходящиеОбъекты.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеПолей = ВходящиеДанные.ДанныеПолей;
	
	Если ПоляВвода=Неопределено Тогда
		ПоляВвода = ПоляВвода();
	КонецЕсли;
	
	ЗаполненныеПоляМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ЗаполненныеПоляМассив;
	
	Для Каждого Объект Из ВходящиеОбъекты Цикл
		ТипОбъекта = ТипЗнч(Объект);
		
		ПоляПоТипу = Новый Массив;
		Для Каждого ПолеВвода Из ПоляВвода Цикл
			Если ТипЗнч(ПолеВвода.ТипЗначения)=Тип("ОписаниеТипов") И ПолеВвода.ТипЗначения.Типы().Найти(ТипОбъекта) <> Неопределено Тогда
				ПоляПоТипу.Добавить(ПолеВвода.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Если ПоляПоТипу.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;

		Если ПоляПоТипу.Количество() > 1 Тогда
			Для Каждого ПолеВвода Из ПоляПоТипу Цикл
				Если ЗаполненныеПоляМассив.Найти(ПолеВвода)=Неопределено Тогда
					//оставим первое незаполненное поле
					ПоляПоТипу.Очистить();
					ПоляПоТипу.Добавить(ПолеВвода);
					ЗаполненныеПоляМассив.Добавить(ПолеВвода);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ПолеВвода = ПоляПоТипу[ПоляПоТипу.Количество()-1];
		ДанныеПолей.Вставить(ПолеВвода, Объект);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьРабочиеСтраницы(Страницы) Экспорт
	
	ПараметрыМодуля.РабочиеСтраницы = РК.ЗначениеВМассив(Страницы);
	
	Возврат Истина;
	
КонецФункции

Функция ВводДоступен() Экспорт
	
	Если ПараметрыМодуля.РабочиеСтраницы=Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыОбработки.РабочаяСтраница=Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ПараметрыМодуля.РабочиеСтраницы.Найти(ПараметрыОбработки.РабочаяСтраница) <> Неопределено;
	
КонецФункции

Функция ВыполнитьЗавершениеОперации() Экспорт
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

//
//						Реализация методов-
//
////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Библиотека функций+
//

#Область БиблиотекаФункций
Функция ЕстьЗависимостиПолей(Поля) Экспорт
	
	Если ТипЗнч(Поля)=Тип("Структура") Тогда
		ПоляМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(Поля, "Ключ");
	Иначе
		ПоляМассив = РК.ЗначениеВМассив(Поля);
	КонецЕсли;
	
	ПоляЗависимости = РК.ПересечениеМассивов(ПоляМассив, ПараметрыМодуля.ЗависимостиПолей);
	
	Возврат ПоляЗависимости.Количество() > 0;
	
КонецФункции
#КонецОбласти

//
//						Библиотека функций-
//
////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Объявление функций+
//

#Область ОбъявлениеФункций

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция ДобавитьКомандуКонтекстногоМенюПоля(ИмяПоля, ИмяКоманды, ЗаголовокКоманды, знач ОбработчикКоманды)
	
	Если ТипЗнч(ОбработчикКоманды)=Тип("Строка") Тогда
		ОбработчикКоманды = НовыйОписаниеОповещения(ОбработчикКоманды);
	КонецЕсли;
	
	Возврат СтандартныйМодуль.ДобавитьКомандуКонтекстногоМенюПоля(ИмяПоля, ИмяКоманды, ЗаголовокКоманды, ОбработчикКоманды);
	
КонецФункции

Функция ПолеОбработки(Отбор)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции
	
Функция ПоляОбработки(Отбор=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция УстановитьСвойстваПолейМодуля(Поля=Неопределено, Свойства=Неопределено, ЗначениеСвойства=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыМодуля, Поля, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция УдалитьПоляМодуля(Поля=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УдалитьПоляОбработки(ПараметрыМодуля, Поля);
	
КонецФункции

Функция ТаблицаПолейМодуля(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция ПолеМодуля(Отбор)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция ПолучитьПолеМодуля(Отбор)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьПолеОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции
	
Функция ПоляМодуля(Отбор=Неопределено) Экспорт

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция СписокПолейМодуля(Отбор=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция СписокПолейВвода()

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыМодуля);
	
КонецФункции

Функция ПоляВывода()

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыМодуля);
	
КонецФункции

Функция ПоляВвода()

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыМодуля);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(знач ОписаниеОбработчика, знач Группа, знач Место=Неопределено, знач Имя=Неопределено)
	
	Если ТипЗнч(ОписаниеОбработчика)=Тип("Строка") Тогда
		ОписаниеОбработчика = НовыйОписаниеОповещения(ОписаниеОбработчика);
	КонецЕсли;
	
	Возврат Интерфейс.ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место, Имя);
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат Интерфейс.НовыйОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено);
	
	Возврат Интерфейс.Действие(Код, ПараметрыДействия);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено, ИмяЗвука=Неопределено)
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, ИмяЗвука);
	
КонецФункции

#КонецОбласти

//
//						Объявление функций-
//
////////////////////////////////////////////////////////////////////////////////////////////

РК = вмс_РаботаСКоллекциями;
#КонецЕсли
